DataProcessors/ЗагрузкаЭталонногоСправочникаИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЭталонногоСправочникаИндексов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЭталонныйСправочникИндексовРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЭталонныйСправочникИндексовРФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаименованиеРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаЭталонногоСправочникаИндексов/Ext/ObjectModule.bsl
Процедура ЗагрузитьСправочникИндексов(ПутьКФайлу,ПолеИсходнойТаблицы) Экспорт
	Таблица = Новый XBase;
	Таблица.ОткрытьФайл(ПутьКФайлу,,Истина);
		
	//Сообщить("В таблице " + Таблица.КоличествоЗаписей() + " записей.");
	//Сообщить("Таблица имеет кодировку: " + Таблица.Кодировка);
	Если Таблица.Кодировка = КодировкаXBase.ANSI Тогда
		Таблица.Кодировка = КодировкаXBase.OEM;
	КонецЕсли;	
	
	Таблица.Первая(); // перешли к первой записи
	Пока Не Таблица.ВКонце() Цикл
		Если Не Таблица.ЗаписьУдалена() Тогда
			МЗ = РегистрыСведений.ЭталонныйСправочникИндексовРФ.СоздатьМенеджерЗаписи();
			МЗ.Индекс = Таблица.INDEX;
			НаименованиеРегиона= ?(ЗначениеЗаполнено(Таблица.REGION),Таблица.REGION,Таблица.AUTONOM);
			МЗ.НаименованиеРегиона = НаименованиеРегиона;
			КодРегиона = НайтиКодРегиона(НаименованиеРегиона,ПолеИсходнойТаблицы);
			МЗ.КодРегиона = КодРегиона;
			МЗ.Записать(Истина);
		КонецЕсли;
		Таблица.Следующая();
	КонецЦикла;    
	
	Таблица.ЗакрытьФайл();
	
	
КонецПроцедуры	

Функция НайтиКодРегиона(ИмяРегиона,ПолеИсходнойТаблицы)
	КодРег = 0;
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(1, "ЧГ=")).Текст;
		НаименованиеРегионаЗнач = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(2, "ЧГ=")).Текст;
		НаименованиеРегионаЗнач = ВРег(НаименованиеРегионаЗнач);
		Если СтрНайти(ИмяРегиона,НаименованиеРегионаЗнач,,,)>0 Тогда
			КодРег = Число(КодРегионаЗнач);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат КодРег;
КонецФункции
